Repository: ColumbiaRoad/intrum-woocommerce-gateaway
Catalog: languages/intrum_wc_gateway-*.po
Languages: fi

source: Pay all at once or in installments
fi: Yrityslaskun avulla voit maksaa yrityksen nimissä tehdyt tilaukset helposti ja turvallisesti laskulla. Lasku lähetetään suoraan yritykselle kun tilaus on toimitettu. Yrityslaskua voivat käyttää kaikki Y-tunnukselliset yritykset, yhteisöt sekä julkiset organisaatiot.

source: What is Yrityslasku?
fi: Mikä on Yrityslasku?

source: Intrum Justitia Yrityslasku for Woocommerce
fi: Intrum Justitia Yrtyslasku Woocommercelle

source: Enable/Disable
fi: Ota käyttöön/poista käytöstä

source: Enable Intrum Justitia Woocommerce Payment Gateway
fi: Ota Intrum Justitia Yrityslasku käyttöön

source: Enable purchase restrictions checking
fi: Käytä ostorajoitusten tarkistusta

source: Use Company ID (Y-tunnus) for checking purchase restrictions
fi: Ostorajoitukset tarkistetaan yrityksen Y-tunnuksen avulla

source: Bypass TUPAS -identification
fi: Ohita TUPAS-tunnistautuminen

source: Use Person ID (henkilötunnus) for checking purchase restrictions
fi: Jos tämä on valittu, pitää asiakkaan syöttää henkilötunnus verkkokaupan kassalla

source: Title
fi: Otsikko

source: This controls the title which the user sees during checkout.
fi: Asiakkaalle verkkokaupan kassalla näytettävä otsikko.

source: Description
fi: Kuvaus

source: This controls the description which the user sees during checkout.
fi: Asiakkaalle verkkokaupan kassalla näytettävä kuvaus.

source: Pay in installments or all at once
fi: Yrityslaskun avulla voit maksaa yrityksen nimissä tehdyt tilaukset helposti ja turvallisesti laskulla. Lasku lähetetään suoraan yritykselle kun tilaus on toimitettu. Yrityslaskua voivat käyttää kaikki Y-tunnukselliset yritykset, yhteisöt sekä julkiset organisaatiot.

source: Merchant Id
fi: Kauppiastunnus

source: Add your merchant Id
fi: Verkkokauppasi kauppiastunnus, jonka olet saanut sopimuksen teon yhteydessä Intrum Justitialta.

source: Password
fi: Salasana

source: Add your password
fi: Intrum Justitialta saamasi salasana.

source: Language
fi: Kielivalinta

source: Automatic
fi: Automaattinen

source: Finnish
fi: suomi

source: Swedish
fi: ruotsi

source: English
fi: englanti

source: Payment language (Automatic gets language from Wordpress. If Wordpress language is not Finnish or Swedish, then uses English)
fi: Maksutavan kieli: 'Automaattinen' käyttää WordPressin kielivalintaa. Jos valittua kieltä ei ole saatavilla, oletus on englanti.

source: Tax code
fi: Verokoodi

source: tax not included: 1 = 24% , 2 = 14%, 3 = 10%<br>tax included: 44 = 24%, 45 = 14%, 46 = 10%<br>9 = 0%
fi: Hinnat ilman veroa: 1 = 24% , 2 = 14%, 3 = 10%<br>Verolliset hinnat: 44 = 24%, 45 = 14%, 46 = 10%<br>9 = 0%

source: Company ID
fi: Y-tunnus

source: Person ID
fi: Henkilötunnus

source: Please enter value for Company ID.
fi: Y-tunnus on pakollinen tieto

source: Please enter value for Person ID.
fi: Henkilötunnus on pakollinen tieto

source: Test mode
fi: Testitila

source: Use test mode only
fi: Käytä testitilassa

source: Use Person ID: 010120-0120 and select Intrum Justitia for identification.
fi: Käytä heknilötunnusta 010120-0120 ja valitse Intrum Justitia tunnistautumisen yhteydessä

source: Yrityslasku is approved
fi: Yrityslasku on hyväksytty

source: Intrum Justitia Woocommerce Gateway
fi: Intrum Justitia Yrtyslasku Woocommercelle

source: Intrum Justitia gateway for woocommerce
fi: Intrum Justitia Yrtyslasku Woocommercelle
